PinkFluffyUnic0rn/stm32flight/main.c
#include <math.h>
#include <string.h>
#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>

#include "main.h"
#include "device.h"
#include "uartdebug.h"
#include "mpu6500.h"
#include "hp206c.h"
#include "esp8266.h"
#include "qmc5883l.h"
#include "dsp.h"
#include "crsf.h"

// Max length for info packet
// sent back to operator
#define INFOLEN 512

// device numbers
#define MPU_DEV 0
#define HP_DEV 1
#define QMC_DEV 2
#define CRSF_DEV 3
#define DEV_COUNT 4

// timers prescaler
#define PRESCALER 48

// clock frequency
#define OCSFREQ 48000000

// period for main timer (used to timing periodic events)
#define TIMPERIOD 0xfff

// main timer ticks per second
#define TICKSPERSEC (OCSFREQ / PRESCALER)

// PWM settings
#define PWM_MAXCOUNT 2500

// Periodic events frequencies
#define PID_FREQ 1000
#define CALIB_FREQ 25
#define HP_FREQ 25
#define CRSF_FREQ 100
#define QMC_FREQ 100

// MCU flash address where quadcopter settings is stored
#define USER_FLASH 0x0801f800

// quadcopter setting's slot (currently unused)
#define USER_SETSLOTS (0x80 / sizeof(struct settings))

// Timer events IDs
#define TEV_PID 	0
#define TEV_CHECK 	1
#define TEV_CALIB	2
#define TEV_HP		3
#define TEV_QMC		4
#define TEV_COUNT	5

// Debug connection port
#define SERVPORT 8880

// Unused, should be removed
#define WIFI_TIMEOUT 3

// Timeout in seconds before quadcopter disarm
// when got no data from ERLS receiver
#define ELRS_TIMEOUT 3

// check if enough time passed to call periodic event again.
// ev -- periodic event's context.
#define checktimev(ev) ((ev)->ms > TICKSPERSEC / (ev)->freq)

// reset periodic event's counter. Used after every
// event's callback call.
// ev -- periodic event's context.
#define resettimev(ev) (ev)->ms = 0;

// update periodic event's counter.
// ev -- periodic event's context.
// s -- time in microseconds after last callback's call.
#define updatetimev(ev, s) (ev)->ms += (s);

// Quadcopter settings structure stored in MCU's flash
struct settings {
	float mx0,	my0,		mz0;
	float mxsc,	mysc,		mzsc;
	float magdecl;

	float gx0,	gy0,		gz0;
	float roll0,	pitch0,		yaw0;

	float tcoef, ttcoef, atcoef;

	int speedpid;
	int yawspeedpid;
	float p,	i,	d;
	float sp,	si,	sd;
	float yp,	yi,	yd;
	float ysp,	ysi,	ysd;
	float zsp,	zsi,	zsd;
};

// Periodic event's context that holds event's settings
// and data needed beetween calls
struct timev {
	int ms;
	int freq;
	int (*cb)(int);
};

// STM32 clocks and periphery devices initilization
void systemclock_config();
static void gpio_init();
static void i2c_init();
static void spi1_init();
static void dma_init();
static void tim1_init();
static void tim2_init();
static void adc1_init(void);
static void usart1_init();
static void usart2_init();
static void usart3_init();

// Init ESC's
static void esc_init();

// Init HP206c barometer
static void hp_init();

// Init MPU6050 IMU
static void mpu_init();

// Init QMC5883L magnetometer
static void qmc_init();

// Init ESP07
static void espdev_init();

// Init ERLS receiver driver
static void crsfdev_init();

// STM32 perithery contexts
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c1;
SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;
DMA_HandleTypeDef hdma_usart2_rx;

// Flight controller board's devices drivers
struct cdevice dev[DEV_COUNT];
struct esp_device espdev;
struct crsf_device crsfdev;

// DSP contexts
struct dsp_lpf tlpf;
struct dsp_lpf altlpf;
float temp;
struct qmc_data qmcdata;

struct dsp_compl pitchcompl;
struct dsp_compl rollcompl;

struct dsp_pidval pitchpv;
struct dsp_pidval rollpv;
struct dsp_pidval pitchspv;
struct dsp_pidval rollspv;
struct dsp_pidval yawpv;
struct dsp_pidval yawspv;
struct dsp_pidval tpv;

// Control values
float thrust = 0.0;
float rolltarget = 0.0, pitchtarget = 0.0, yawtarget = 0.0;
float en = 0.0;
int magcalibmode = 0;
int elrs = 0;

// Pressure and altitude initial values
float alt0;

// Settings
struct settings st;

// Timer events
struct timev evs[TEV_COUNT];

// Stabilization loops counter
int loops = 0;

// Stabilization loops performed in last second
int loopscount = 0;

// Timeout counter for the ELRS reciver. Set to ELRS_TIMEOUT after
// receiving useful packet from receiver and decreased by 1 every
// second. If it falls to 0, quadcopter disarms
int elrstimeout = ELRS_TIMEOUT;

// Get value from ADC, was used to monitor battery voltage
uint32_t getadcv(ADC_HandleTypeDef *hadc)
{
	uint32_t v;

	HAL_ADC_Start(hadc);
	HAL_ADC_PollForConversion(hadc, 1);

	v = HAL_ADC_GetValue(hadc);

	HAL_ADC_Stop(hadc);

	return v;
}

// UART receive callback. It calls interrupt handlers from
// drivers for devices working through UART
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) 
{
	esp_interrupt(&espdev, huart);
	
	if (dev[CRSF_DEV].status == DEVSTATUS_INIT)
		dev[CRSF_DEV].interrupt(dev[CRSF_DEV].priv, huart);
}

// UART error callback. Calls UART error handlers from
// drivers for devices working through UART
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	esp_error(&espdev, huart);
}

// Initilize periodic event's context
// ev -- periodic event's context.
// freq -- periodic event's frequency in Hz (calls per second).
// cb -- callback that is called by this event.
int inittimev(struct timev *ev, int freq, int (*cb)(int))
{
	ev->ms = 0;
	ev->freq = freq;
	ev->cb = cb;

	return 0;
}

int averageposition(float *ax, float *ay, float *az, float *gx,
	float *gy, float *gz)
{
	struct mpu_data md;
	float axt, ayt, azt, gxt, gyt, gzt;
	int i;

	axt = ayt = azt = gxt = gyt = gzt = 0;
	for (i = 0; i < 250; ++i) {
		dev[MPU_DEV].read(dev[MPU_DEV].priv, &md,
			sizeof(struct mpu_data));

		gxt += md.gfx;
		gyt += md.gfy;
		gzt += md.gfz;

		axt += md.afx;
		ayt += md.afy;
		azt += md.afz;

		HAL_Delay(10);
	}

	*gx = gxt / 250.0;
	*gy = gyt / 250.0;
	*gz = gzt / 250.0;

	*ax = axt / 250.0;
	*ay = ayt / 250.0;
	*az = azt / 250.0;

