PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

float qmc_heading(float r, float p, float x, float y, float z)
{
	x = st.mxsc * (x + st.mx0);
	y = st.mysc * (y + st.my0);
	z = st.mzsc * (z + st.mz0);

	x = x * cosf(p) + y * sinf(r) * sinf(p)
		+ z * cosf(r) * sinf(p);
	y = y * cosf(r) - z * sinf(r);

	return circf(atan2f(y, x) + st.magdecl);
}

int setthrust(float ltd, float rtd, float rbd, float lbd)
{
	if (isnan(ltd) || isnan(rtd) || isnan(rbd) || isnan(lbd))
		ltd = rtd = rbd = lbd = 0.0;

	TIM1->CCR1 = (uint16_t) ((trimuf(ltd) * 0.05 + 0.049)
		* (float) PWM_MAXCOUNT);
	TIM1->CCR2 = (uint16_t) ((trimuf(rtd) * 0.05 + 0.049)
		* (float) PWM_MAXCOUNT);
	TIM1->CCR3 = (uint16_t) ((trimuf(rbd) * 0.05 + 0.049)
		* (float) PWM_MAXCOUNT);
	TIM1->CCR4 = (uint16_t) ((trimuf(lbd) * 0.05 + 0.049)
		* (float) PWM_MAXCOUNT);

	return 0;
}

int writesettings(int slot)
{
	FLASH_EraseInitTypeDef ferase;
	uint32_t serror;
	uint32_t sz;
	uint32_t *pt;
	uint32_t addr;
	int j;

	__disable_irq();
	HAL_FLASH_Unlock();

	ferase.TypeErase = FLASH_TYPEERASE_PAGES;
	ferase.PageAddress = USER_FLASH;
	ferase.NbPages = 1;
	HAL_FLASHEx_Erase(&ferase, &serror);

	sz = sizeof(struct settings);
	pt = (uint32_t *) &st;

	addr = USER_FLASH + sizeof(struct settings) * slot;
	for (j = 0; j < sz / 4; ++j) {
		HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, pt[j]);
		addr += 4;
	}

	HAL_FLASH_Lock();
	__enable_irq();

	return 0;
}

int readsettings(int slot)
{
	memcpy(&st, (void *) (USER_FLASH + slot),
		sizeof(struct settings));

	return 0;
}

int initstabilize(float alt)
{
	float ax, ay, az;

	alt0 = alt;

	averageposition(&ax, &ay, &az, &(st.gx0), &(st.gy0), &(st.gz0));

	dsp_initcompl(&pitchcompl, st.tcoef, PID_FREQ);
	dsp_initcompl(&rollcompl, st.tcoef, PID_FREQ);

	dsp_initpidval(&pitchpv, st.p, st.i, st.d, 0.0);
	dsp_initpidval(&rollpv, st.p, st.i, st.d, 0.0);

	dsp_initpidval(&pitchspv, st.sp, st.si, st.sd, 0.0);
	dsp_initpidval(&rollspv, st.sp, st.si, st.sd, 0.0);
	dsp_initpidval(&yawspv, st.ysp, st.ysi, st.ysd, 0.0);
	dsp_initpidval(&yawpv, st.yp, st.yi, st.yd, 0.0);
	dsp_initpidval(&tpv, st.zsp, st.zsi, st.zsd, 0.0);

	dsp_initlpf(&altlpf, st.atcoef, HP_FREQ);
	dsp_initlpf(&tlpf, st.ttcoef, PID_FREQ);

	return 0;
}

int stabilize(int ms)
{
	struct mpu_data md;
	float roll, pitch, yaw;
	float rollcor, pitchcor, yawcor, thrustcor;
	float gy, gx, gz;
	float dt;
			
	dt = ms / (float) TICKSPERSEC;
	dt = (dt < 0.000001) ? 0.000001 : dt;

	dev[MPU_DEV].read(dev[MPU_DEV].priv, &md,
		sizeof(struct mpu_data));

	dsp_updatelpf(&tlpf, md.afz);

	gy = deg2rad((md.gfy - st.gy0));
	gx = deg2rad((md.gfx - st.gx0));
	gz = deg2rad((md.gfz - st.gz0));

	roll = dsp_updatecompl(&rollcompl, gy * dt,
		atan2f(-md.afx,
		sqrt(md.afy * md.afy + md.afz * md.afz))) - st.roll0;

	pitch = dsp_updatecompl(&pitchcompl, gx * dt,
		atan2f(md.afy,
		sqrt(md.afx * md.afx + md.afz * md.afz))) - st.pitch0;

	yaw = circf(qmc_heading(pitch, roll,
		qmcdata.fx, qmcdata.fy, qmcdata.fz) - st.yaw0);

	if (st.speedpid) {
		rollcor = dsp_pid(&rollspv, rolltarget, gy, dt);
		pitchcor = dsp_pid(&pitchspv, pitchtarget, gx, dt);
	}
	else {
		rollcor = dsp_pid(&rollpv, rolltarget, roll, dt);
		pitchcor = dsp_pid(&pitchpv, pitchtarget, pitch, dt);

		rollcor = dsp_pid(&rollspv, rollcor, gy, dt);
		pitchcor = dsp_pid(&pitchspv, pitchcor, gx, dt);
	}

	if (st.yawspeedpid)
		yawcor = dsp_pid(&yawspv, yawtarget, gz, dt);
	else {
		yawcor = dsp_circpid(&yawpv, yawtarget, yaw, dt);

		yawcor = dsp_pid(&yawspv, yawcor, gz, dt);
	}

	thrustcor = dsp_pid(&tpv, thrust + 1.0, dsp_getlpf(&tlpf), dt);

	setthrust(en * (thrustcor + 0.5 * rollcor
			+ 0.5 * pitchcor - 0.5 * yawcor),
		en * (thrustcor - 0.5 * rollcor
			+ 0.5 * pitchcor + 0.5 * yawcor),
		en * (thrustcor - 0.5 * rollcor
			- 0.5 * pitchcor - 0.5 * yawcor),
		en * (thrustcor + 0.5 * rollcor
			- 0.5 * pitchcor + 0.5 * yawcor));
			
	++loops;

	return 0;
}

int checkconnection(int ms)
{
	if (elrstimeout != 0)
		--elrstimeout;

	if (elrstimeout <= 0 && elrs == 1) {
		setthrust(0.0, 0.0, 0.0, 0.0);
		en = 0.0;
	}
	
	// since it runs every 1 second update loop counter here too
	loopscount = loops;
	loops = 0;

	return 0;
}

int magcalib(int ms)
{
	struct qmc_data hd;
	char s[INFOLEN];

	if (!magcalibmode)
		return 0;

	dev[QMC_DEV].read(dev[QMC_DEV].priv, &hd,
		sizeof(struct qmc_data));

	sprintf(s, "%f %f %f\r\n",
		(double) (st.mxsc * (hd.fx + st.mx0)),
		(double) (st.mysc * (hd.fy + st.my0)),
		(double) (st.mzsc * (hd.fz + st.mz0)));

	esp_send(&espdev, s);

	return 0;
}

int hpupdate(int ms)
{
	struct hp_data hd;
	
	if (dev[HP_DEV].status != DEVSTATUS_INIT) 
		return 0;

	dev[HP_DEV].read(dev[HP_DEV].priv, &hd,
		sizeof(struct hp_data));

	dsp_updatelpf(&altlpf, hd.altf);
	temp = hd.tempf;

	return 0;
}

int qmcupdate(int ms)
{
	dev[QMC_DEV].read(dev[QMC_DEV].priv, &qmcdata,
		sizeof(struct qmc_data));

	return 0;
}

int crsfget(int ms)
{
	return 0;
}

int parsecommand(char **toks, int maxtoks, char *data)
{
	int i;

	for (i = 0; i < maxtoks; ++i)
		toks[i] = "";

	i = 0;

	toks[i++] = strtok((char *) data, " ");

	while (i < maxtoks && (toks[i++] = strtok(NULL, " ")) != NULL);

	return (i - 1);
}

int sprintpos(char *s, struct mpu_data *md, struct qmc_data *hd)
{
	s[0] = '\0';

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"%-7sx = %0.3f; y = %0.3f; z = %0.3f\n\r", "accel: ",
		(double) md->afx, (double) md->afy, (double) md->afz);
	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"%-7sx = %0.3f; y = %0.3f; z = %0.3f\n\r", "gyro: ",
		(double) md->gfx, (double) md->gfy, (double) md->gfz);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"roll: %0.3f; pitch: %0.3f; yaw: %0.3f\n\r",
		(double) (dsp_getcompl(&rollcompl) - st.roll0),
		(double) (dsp_getcompl(&pitchcompl) - st.pitch0),
		(double) circf(qmc_heading(
			-(dsp_getcompl(&pitchcompl) - st.pitch0),
			-(dsp_getcompl(&rollcompl) - st.roll0),
			hd->fx, hd->fy, hd->fz) - st.yaw0));

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"z acceleration: %f\r\n",
		(double) dsp_getlpf(&tlpf));

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"battery: %0.3f\n\r",
		getadcv(&hadc1) / (double) 0xfff * (double) 9.9276);

