PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

int sprintqmc(char *s, struct qmc_data *hd)
{
	s[0] = '\0';

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"x = %0.3f; y = %0.3f; z = %0.3f\n\r",
		(double) qmcdata.fx, (double) qmcdata.fy,
		(double) qmcdata.fz);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"heading: %f\r\n", (double) qmc_heading(
			(dsp_getcompl(&pitchcompl) - st.pitch0),
			(dsp_getcompl(&rollcompl) - st.roll0),
			hd->fx, hd->fy, hd->fz));

	return 0;
}

int sprintvalues(char *s)
{
	s[0] = '\0';

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"t: %.3f; r: %.3f; p: %.3f; y: %.3f\r\n",
		(double) thrust, (double) rolltarget,
		(double) pitchtarget, (double) yawtarget);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"mag off: %.3f; %.3f; %.3f\r\n",
		(double) st.mx0, (double) st.my0, (double) st.mz0);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"mag scale: %.3f; %.3f; %.3f\r\n",
		(double) st.mxsc, (double) st.mysc, (double) st.mzsc);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"mag decl: %.5f\r\n",
		(double) st.magdecl);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"gyro cor: %.3f; %.3f; %.3f\r\n",
		(double) st.gx0, (double) st.gy0, (double) st.gz0);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"roll cor: %.3f; pitch cor: %.3f; yaw cor: %.3f\r\n",
		(double) st.roll0, (double) st.pitch0,
		(double) st.yaw0);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"motors state: %.3f\r\n", (double) en);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"tc: %.6f\r\n", (double) st.tcoef);
	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"accel tc: %.6f\r\n", (double) st.ttcoef);
	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"altitude tc: %.6f\r\n", (double) st.atcoef);
	
	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"loops count: %d\r\n", loopscount);

	return 0;
}

int sprintpid(char *s)
{
	s[0] = '\0';

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"pos PID: %.3f,%.3f,%.3f\r\n",
		(double) st.p, (double) st.i, (double) st.d);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"speed PID: %.3f,%.3f,%.3f\r\n",
		(double) st.sp, (double) st.si, (double) st.sd);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"yaw PID: %.3f,%.3f,%.3f\r\n",
		(double) st.yp, (double) st.yi, (double) st.yd);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"yaw speed PID: %.3f,%.3f,%.3f\r\n",
		(double) st.ysp, (double) st.ysi, (double) st.ysd);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"thrust PID: %.3f,%.3f,%.3f\r\n",
		(double) st.zsp, (double) st.zsi, (double) st.zsd);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"%s mode\r\n", st.speedpid ? "single" : "dual");

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"%s yaw mode\r\n",
		st.yawspeedpid ? "single" : "dual");
	
	return 0;
}

int controlcmd(char *cmd)
{
	char s[INFOLEN];
	char *toks[12];

	if (cmd[0] == '\0')
		return 0;

	parsecommand(toks, 12, cmd);

	if (strcmp(toks[0], "info") == 0) {
		if (strcmp(toks[1], "mpu") == 0) {
			struct mpu_data md;
			struct qmc_data hd;

			dev[MPU_DEV].read(dev[MPU_DEV].priv, &md,
				sizeof(struct mpu_data));

			dev[QMC_DEV].read(dev[QMC_DEV].priv, &hd,
				sizeof(struct qmc_data));

			sprintpos(s, &md, &hd);

			esp_send(&espdev, s);
		}
		else if (strcmp(toks[1], "qmc") == 0) {
			struct qmc_data hd;

			dev[QMC_DEV].read(dev[QMC_DEV].priv, &hd,
				sizeof(struct qmc_data));
		
			sprintqmc(s, &hd);	
		
			esp_send(&espdev, s);
		}
		else if (strcmp(toks[1], "hp") == 0) {
			float alt;

			alt = dsp_getlpf(&altlpf);

			snprintf(s, INFOLEN, "temp: %f; alt: %f\r\n",
				(double) temp, (double) alt);
			
			esp_send(&espdev, s);
		}
		else if (strcmp(toks[1], "values") == 0) {
			sprintvalues(s);
			esp_send(&espdev, s);
		}
		else if (strcmp(toks[1], "pid") == 0) {
			sprintpid(s);
			esp_send(&espdev, s);
		}
	}
	else if (strcmp(toks[0], "r") == 0)
		en = 0.0;
	else if (strcmp(toks[0], "e") == 0)
		en = 1.0;
	else if (strcmp(toks[0], "c") == 0)
		initstabilize(atof(toks[1]));
	else if (strcmp(toks[0], "calib") == 0) {
		if (strcmp(toks[1], "mag") == 0) {
			if (strcmp(toks[2], "on") == 0)
				magcalibmode = 1;
			else if (strcmp(toks[2], "off") == 0)
				magcalibmode = 0;
			else
				goto unknown;
		}
		else
			goto unknown;
	}
	else if (strcmp(toks[0], "flash") == 0) {
		if (strcmp(toks[1], "write") == 0)
			writesettings(atoi(toks[2]));	
		else if (strcmp(toks[1], "read") == 0)
			readsettings(atoi(toks[2]));
	}
	else if (strcmp(toks[0], "pid") == 0) {
		float v;
	
		v = atof(toks[3]);
		
		if (strcmp(toks[1], "tilt") == 0) {
			if (strcmp(toks[2], "mode") == 0) {
				if (strcmp(toks[3], "double") == 0)
					st.speedpid = 0;
				else if (strcmp(toks[3], "single") == 0)
					st.speedpid = 1;
				else
					goto unknown;
			}
			else if (strcmp(toks[2], "p") == 0)
				st.p = v;
			else if (strcmp(toks[2], "i") == 0)
				st.i = v;
			else if (strcmp(toks[2], "d") == 0)
				st.d = v;
			else
				goto unknown;
	
			dsp_setpid(&pitchpv, st.p, st.i, st.d);
			dsp_setpid(&rollpv, st.p, st.i, st.d);
		}
		else if (strcmp(toks[1], "stilt") == 0) {
			if (strcmp(toks[2], "p") == 0)
				st.sp = v;
			else if (strcmp(toks[2], "i") == 0)
				st.si = v;
			else if (strcmp(toks[2], "d") == 0)
				st.sd = v;
			else
				goto unknown;

			dsp_setpid(&pitchspv, st.sp, st.si, st.sd);
			dsp_setpid(&rollspv, st.sp, st.si, st.sd);
		}
		else if (strcmp(toks[1], "yaw") == 0) {
			if (strcmp(toks[2], "mode") == 0) {
				if (strcmp(toks[3], "double") == 0)
					st.yawspeedpid = 0;
				else if (strcmp(toks[3], "single") == 0)
					st.yawspeedpid = 1;
				else
					goto unknown;
			}
			else if (strcmp(toks[2], "p") == 0)
				st.yp = v;
			else if (strcmp(toks[2], "i") == 0)
				st.yi = v;
			else if (strcmp(toks[2], "d") == 0)
				st.yd = v;
			else
				goto unknown;
		
			dsp_setpid(&yawpv, st.yp, st.yi, st.yd);
		}
		else if (strcmp(toks[1], "syaw") == 0) {
			if (strcmp(toks[2], "p") == 0)
				st.ysp = v;
			else if (strcmp(toks[2], "i") == 0)
				st.ysi = v;
			else if (strcmp(toks[2], "d") == 0)
				st.ysd = v;
			else
				goto unknown;
		
			dsp_setpid(&yawspv, st.ysp, st.ysi, st.ysd);
		}
		else if (strcmp(toks[1], "climb") == 0) {
			if (strcmp(toks[2], "p") == 0)
				st.zsp = v;
			else if (strcmp(toks[2], "i") == 0)
				st.zsi = v;
			else if (strcmp(toks[2], "d") == 0)
				st.zsd = v;
			else
				goto unknown;

