PinkFluffyUnic0rn/stm32flight/main.c
			dsp_setpid(&tpv, st.zsp, st.zsi, st.zsd);
		}
		else
			goto unknown;
	}
	else if (strcmp(toks[0], "compl") == 0) {
		st.tcoef = atof(toks[1]);
		
		dsp_initcompl(&pitchcompl, st.tcoef, PID_FREQ);
		dsp_initcompl(&rollcompl, st.tcoef, PID_FREQ);	
	}
	else if (strcmp(toks[0], "lpf") == 0) {
		if (strcmp(toks[1], "climb") == 0) {
			st.ttcoef = atof(toks[2]);
			
			dsp_initlpf(&tlpf, st.ttcoef, PID_FREQ);
		}
		else if (strcmp(toks[1], "altitude") == 0) {
			st.atcoef = atof(toks[2]);
				
			dsp_initlpf(&altlpf, st.atcoef, HP_FREQ);
		}
		else
			goto unknown;
	}
	else if (strcmp(toks[0], "adj") == 0) {
		float v;
	
		v = atof(toks[2]);
		
		if (strcmp(toks[1], "roll") == 0)	st.roll0 = v;
		else if (strcmp(toks[1], "pitch") == 0)	st.pitch0 = v;
		else if (strcmp(toks[1], "yaw") == 0)	st.yaw0 = v;
		else if (strcmp(toks[1], "mag") == 0) {
			if (strcmp(toks[2], "x0") == 0)
				st.mx0 = atof(toks[3]);
			else if (strcmp(toks[2], "y0") == 0)
				st.my0 = atof(toks[3]);
			else if (strcmp(toks[2], "z0") == 0)
				st.mz0 = atof(toks[3]);
			else if (strcmp(toks[2], "xscale") == 0)
				st.mxsc = atof(toks[3]);
			else if (strcmp(toks[2], "yscale") == 0)
				st.mysc = atof(toks[3]);
			else if (strcmp(toks[2], "zscale") == 0)
				st.mzsc = atof(toks[3]);
			else if (strcmp(toks[2], "decl") == 0)
				st.magdecl = atof(toks[3]);
			else
				goto unknown;
		}
		else
			goto unknown;
	}
	else
		goto unknown;

	return 0;

unknown:
	snprintf(s, INFOLEN, "Unknown command: %s\r\n", cmd);
	esp_send(&espdev, s);

	return (-1);
}

int crsfcmd(const struct crsf_data *cd, int ms)
{
	elrs = (cd->chf[7] > 0.5) ? 1 : 0;

	elrstimeout = ELRS_TIMEOUT;

	if (elrs) {
		float dt;

		dt = ms / (float) TICKSPERSEC;

		en = 1.0;
	
		pitchtarget = -cd->chf[0] * (M_PI / 6.0);
		rolltarget = -cd->chf[1] * (M_PI / 6.0);
		thrust = (cd->chf[2] + 0.75) / 3.5;
		yawtarget = circf(yawtarget + cd->chf[3] * dt * M_PI);
		en = (cd->chf[5] > 0.5) ? 1 : 0;
	
		if (en < 0.5)
			setthrust(0.0, 0.0, 0.0, 0.0);
	}

	return 0;
}

// Entry point
int main(void)
{
	int elrsus;
	int i;

	HAL_Init();

	systemclock_config();
	
	HAL_Delay(1000);

	for (i = 0; i < DEV_COUNT; ++i)
		dev[i].status = DEVSTATUS_NOINIT;

	gpio_init();
	tim1_init();
	tim2_init();
	dma_init();
	i2c_init();
	spi1_init();
	adc1_init();
	usart1_init();
	usart2_init();
	usart3_init();
	esc_init();
	mpu_init();
	qmc_init();
	espdev_init();
	crsfdev_init();

	HAL_Delay(1000);
	hp_init();

	readsettings(0);

	initstabilize(0.0);

	inittimev(evs + TEV_PID, PID_FREQ, stabilize);
	inittimev(evs + TEV_CHECK, 1, checkconnection);
	inittimev(evs + TEV_CALIB, CALIB_FREQ, magcalib);
	inittimev(evs + TEV_HP, HP_FREQ, hpupdate);
	inittimev(evs + TEV_QMC, QMC_FREQ, qmcupdate);

	elrsus = 0;
	while (1) {
		char cmd[ESP_CMDSIZE];
		struct crsf_data cd;
		int c, i;

		__HAL_TIM_SET_COUNTER(&htim2, 0);

		if (esp_poll(&espdev, cmd) >= 0) 
			controlcmd(cmd);

		if (dev[CRSF_DEV].read(dev[CRSF_DEV].priv, &cd,
			sizeof(struct crsf_data)) >= 0) {
			crsfcmd(&cd, elrsus);
			elrsus = 0;
		}

		for (i = 0; i < TEV_COUNT; ++i) {
			if (checktimev(evs + i)) {
				evs[i].cb(evs[i].ms);
				resettimev(evs + i);
			}
		}

		c = __HAL_TIM_GET_COUNTER(&htim2);

		for (i = 0; i < TEV_COUNT; ++i)
			updatetimev(evs + i, c);

		elrsus += c;
	}

	return 0;
}

void systemclock_config(void)
{
	RCC_OscInitTypeDef RCC_OscInitStruct = {0};
	RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
	RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL3;
	
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
		error_handler();

	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
			      |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
		error_handler();
	
	PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1|RCC_PERIPHCLK_USART2
			      |RCC_PERIPHCLK_I2C1|RCC_PERIPHCLK_TIM1
			      |RCC_PERIPHCLK_ADC12;
	PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
	PeriphClkInit.Usart2ClockSelection = RCC_USART2CLKSOURCE_PCLK1;
	PeriphClkInit.Adc12ClockSelection = RCC_ADC12PLLCLK_DIV256;
	PeriphClkInit.I2c1ClockSelection = RCC_I2C1CLKSOURCE_HSI;
	PeriphClkInit.Tim1ClockSelection = RCC_TIM1CLK_HCLK;
	if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
		error_handler();
}

static void gpio_init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};

	__HAL_RCC_GPIOD_CLK_ENABLE();
	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_GPIOB_CLK_ENABLE();

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);

	GPIO_InitStruct.Pin = GPIO_PIN_4;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}

static void dma_init(void)
{
	__HAL_RCC_DMA1_CLK_ENABLE();

	HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);

	HAL_NVIC_SetPriority(DMA1_Channel6_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(DMA1_Channel6_IRQn);
}

static void i2c_init(void)
{
	hi2c1.Instance = I2C1;
	hi2c1.Init.Timing = 0x0000020B;
	hi2c1.Init.OwnAddress1 = 0;
	hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
	hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
	hi2c1.Init.OwnAddress2 = 0;
	hi2c1.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
	hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
	hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
	if (HAL_I2C_Init(&hi2c1) != HAL_OK)
		error_handler();

	if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
		error_handler();

